src/post_tonal_overtone/org_files/html-versions/supercollider-to-overtone.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-02 Fri 15:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="b" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline2">1. overtone session</a>
<ul>
<li><a href="#orgheadline1">1.1. </a></li>
</ul>
</li>
<li><a href="#orgheadline3">2. supercollider</a></li>
<li><a href="#orgheadline4">3. stop all overtone sound</a></li>
<li><a href="#orgheadline5">4. elisp kmacros</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">1</span> overtone session</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> </h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">junk</span> 1)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">junk
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(use '<span style="color: #7CB8BB;">overtone.live</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(demo (sin-osc))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">sin-test</span> []
  (sin-osc))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(sin-test)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">sin-test2</span> [freq 440 amp 0.3] 
  (* amp (sin-osc freq)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(sin-test2)
(sin-test2 442)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(stop)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">gran-buf</span> (load-sample <span style="color: #CC9393;">"/Users/b/Google Drive/Audio_uploads/wav-file-uploads/goldberg-slow-mono.wav"</span>))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">gran</span> [] (play-buf 1 gran-buf))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(gran)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">grainy</span> [b 0] (<span style="color: #F0DFAF; font-weight: bold;">let</span> [
                         trate (mouse-y:kr 1 30)
                         dur (/ 2 trate)]
                        (t-grains:ar 1 (impulse:ar trate) b 1 (mouse-x:kr 0 (buf-dur:kr b)) dur 0 0.8 2)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(grainy gran-buf)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(midi-connected-devices)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:note-on</span>] (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [{note <span style="color: #BFEBBF;">:note</span> velocity <span style="color: #BFEBBF;">:velocity</span>}]
                             (println <span style="color: #CC9393;">"Note: "</span> note <span style="color: #CC9393;">", Velocity: "</span> velocity))
          <span style="color: #BFEBBF;">::note-printer</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(remove-event-handler <span style="color: #BFEBBF;">::note-printer</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:control-change</span>] (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [{cc-channel <span style="color: #BFEBBF;">:note</span> velocity <span style="color: #BFEBBF;">:velocity</span>}]
                             (println <span style="color: #CC9393;">"knob: "</span> cc-channel <span style="color: #CC9393;">", Velocity: "</span> velocity))
          <span style="color: #BFEBBF;">::cc-printer</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(remove-event-handler <span style="color: #BFEBBF;">::cc-printer</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">grainy-ctl</span> [b 0 trate 1 amp 0.8]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [trate trate
        dur (/ 2 trate)]
    (t-grains:ar 1 (impulse:ar trate) b 1 (mouse-x:kr 0 (buf-dur:kr b)) dur 0 amp 2)))
</pre>
</div>



<div class="org-src-container">

<pre class="src src-clojure">(grainy-ctl <span style="color: #BFEBBF;">:trate</span> 2)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(ctl grainy-ctl <span style="color: #BFEBBF;">:trate</span> 0.5)
</pre>
</div>

<p>
Why does the handler function take a "10" as an argument
</p>
<div class="org-src-container">

<pre class="src src-clojure">(on-event [<span style="color: #BFEBBF;">:midi</span> <span style="color: #BFEBBF;">:control-change</span>]
          (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [{cc-channel <span style="color: #BFEBBF;">:note</span> velocity <span style="color: #BFEBBF;">:velocity</span>}]
          (ctl grainy-ctl <span style="color: #BFEBBF;">:trate</span> (scale-range velocity 1 127 0.1 3)) 10)
            <span style="color: #BFEBBF;">::cc-grainyctl</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(remove-event-handler <span style="color: #BFEBBF;">::cc-grainyctl</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">2</span> supercollider</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-sclang">{ <span style="color: #7CB8BB;">SinOsc</span>.<span style="color: #93E0E3;">ar</span>() }.play
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sclang">{ <span style="color: #7CB8BB;">SinOsc</span>.<span style="color: #93E0E3;">ar</span>([440, 442], 0, 0.4) }.play;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><a id="ID-9A833656-B947-48F7-8118-E522F04F2860"></a><span class="section-number-2">3</span> stop all overtone sound</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-clojure">(stop)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">4</span> elisp kmacros</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-elisp">(fset 'overtone-stop-sound
   [?\C-x ?r ?j ?/ ?\C-c ?\C-v ?\C-n ?\C-c ?\C-c ?\C-u ?\C- ])

(fset 'overtone-org-start-new-block
   [?\C-c ?\C-n return ?\C-p ?&lt; ?s tab ?\M-/ ?\C-n])
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: b</p>
<p class="date">Created: 2016-12-02 Fri 15:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
